In [1]:
import pandas as pd

In [32]:
# creating a simple dataframe

df = pd.DataFrame({'name': ['Olivia','Dean','Alex','Jon','Tom','Jane','Kate'],
           'age': [32,23,45,35,20,28,55],
           'sex':['female', 'male','male','male','male','female','female']})
df

     name  age     sex
0  Olivia   32  female
1    Dean   23    male
2    Alex   45    male
3     Jon   35    male
4     Tom   20    male
5    Jane   28  female
6    Kate   55  female

In [24]:
# Let’s access cell value with index 2 and Column age

df.at[2,'age']

45

In [25]:
# Now let's update this value 

df.at[2,'age']=40

df

     name  age     sex
0  Olivia   32  female
1    Dean   23    male
2    Alex   40    male
3     Jon   35    male
4     Tom   20    male
5    Jane   28  female
6    Kate   55  female

In [30]:
# Let’s access cell value with index 2 and Column age after the change

df.at[2,'age']

40

In [26]:
# Let’s access cell value with index 1 and Column age
df.loc[1].at['age']

23

In [33]:
# Let’s access cell value with index 1 and Column age
df.loc[1].age

23

In [28]:
# let's try changing the value from 23 to 22 and see if df gets modified 
df.loc[1].at['age']=22
df

     name  age     sex
0  Olivia   32  female
1    Dean   23    male
2    Alex   40    male
3     Jon   35    male
4     Tom   20    male
5    Jane   28  female
6    Kate   55  female

In [29]:
df.loc[1].age = 22
df

/usr/local/lib/python3.7/dist-packages/pandas/core/generic.py:5168: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

     name  age     sex
0  Olivia   32  female
1    Dean   23    male
2    Alex   40    male
3     Jon   35    male
4     Tom   20    male
5    Jane   28  female
6    Kate   55  female

In [35]:
# Let’s access cell value with index 1 and Column age (column index 1)
df.iat[1, 1]

23

In [36]:
# Now let's update this value 

df.iat[1, 1]=22
df

     name  age     sex
0  Olivia   32  female
1    Dean   22    male
2    Alex   45    male
3     Jon   35    male
4     Tom   20    male
5    Jane   28  female
6    Kate   55  female